{"config": [{"config": {"activity_regularizer": null, "b_constraint": null, "bias": true, "border_mode": "valid", "name": "convolution2d_1", "nb_filter": 24, "W_regularizer": null, "batch_input_shape": [null, 66, 200, 1], "b_regularizer": null, "input_dtype": "float32", "activation": "linear", "dim_ordering": "tf", "trainable": true, "nb_row": 5, "subsample": [2, 2], "W_constraint": null, "init": "glorot_uniform", "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "bias": true, "border_mode": "valid", "name": "convolution2d_2", "nb_filter": 36, "W_constraint": null, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "dim_ordering": "tf", "trainable": true, "nb_row": 5, "subsample": [2, 2], "b_constraint": null, "init": "glorot_uniform", "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "bias": true, "border_mode": "valid", "name": "convolution2d_3", "nb_filter": 48, "W_constraint": null, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "dim_ordering": "tf", "trainable": true, "nb_row": 5, "subsample": [2, 2], "b_constraint": null, "init": "glorot_uniform", "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "bias": true, "border_mode": "valid", "name": "convolution2d_4", "nb_filter": 64, "W_constraint": null, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "dim_ordering": "tf", "trainable": true, "nb_row": 3, "subsample": [1, 1], "b_constraint": null, "init": "glorot_uniform", "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "bias": true, "border_mode": "valid", "name": "convolution2d_5", "nb_filter": 64, "W_constraint": null, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "dim_ordering": "tf", "trainable": true, "nb_row": 3, "subsample": [1, 1], "b_constraint": null, "init": "glorot_uniform", "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "activation": "linear", "bias": true, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "input_dim": 1152, "output_dim": 100, "trainable": true, "name": "dense_1", "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "activation": "linear", "bias": true, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "input_dim": 100, "output_dim": 50, "trainable": true, "name": "dense_2", "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "activation": "linear", "bias": true, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "input_dim": 50, "output_dim": 10, "trainable": true, "name": "dense_3", "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "activation": "linear", "bias": true, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "input_dim": 10, "output_dim": 1, "trainable": true, "name": "dense_4", "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}