{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "activity_regularizer": null, "W_constraint": null, "input_dtype": "float32", "nb_filter": 24, "b_constraint": null, "border_mode": "valid", "subsample": [2, 2], "nb_col": 5, "init": "glorot_uniform", "name": "convolution2d_1", "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "bias": true, "batch_input_shape": [null, 160, 320, 3], "nb_row": 5, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"trainable": true, "activity_regularizer": null, "W_constraint": null, "input_dtype": "float32", "nb_filter": 36, "b_constraint": null, "border_mode": "valid", "subsample": [2, 2], "nb_col": 5, "init": "glorot_uniform", "name": "convolution2d_2", "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "bias": true, "batch_input_shape": [null, 160, 320, 3], "nb_row": 5, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"trainable": true, "activity_regularizer": null, "W_constraint": null, "input_dtype": "float32", "nb_filter": 48, "b_constraint": null, "border_mode": "valid", "subsample": [2, 2], "nb_col": 5, "init": "glorot_uniform", "name": "convolution2d_3", "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "bias": true, "batch_input_shape": [null, 160, 320, 3], "nb_row": 5, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"trainable": true, "activity_regularizer": null, "W_constraint": null, "input_dtype": "float32", "nb_filter": 64, "b_constraint": null, "border_mode": "valid", "subsample": [1, 1], "nb_col": 3, "init": "glorot_uniform", "name": "convolution2d_4", "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "bias": true, "batch_input_shape": [null, 160, 320, 3], "nb_row": 3, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"trainable": true, "activity_regularizer": null, "W_constraint": null, "input_dtype": "float32", "nb_filter": 64, "b_constraint": null, "border_mode": "valid", "subsample": [1, 1], "nb_col": 3, "init": "glorot_uniform", "name": "convolution2d_5", "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "bias": true, "batch_input_shape": [null, 160, 320, 3], "nb_row": 3, "b_regularizer": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "input_dim": 27456, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "output_dim": 100, "name": "dense_1", "W_regularizer": null, "activation": "linear", "bias": true, "b_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "input_dim": 100, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "output_dim": 50, "name": "dense_2", "W_regularizer": null, "activation": "linear", "bias": true, "b_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "input_dim": 50, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "output_dim": 10, "name": "dense_3", "W_regularizer": null, "activation": "linear", "bias": true, "b_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "input_dim": 10, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "output_dim": 1, "name": "dense_4", "W_regularizer": null, "activation": "linear", "bias": true, "b_regularizer": null}}]}