{"config": [{"config": {"border_mode": "valid", "b_regularizer": null, "nb_row": 5, "trainable": true, "W_constraint": null, "subsample": [2, 2], "name": "convolution2d_1", "b_constraint": null, "input_dtype": "float32", "W_regularizer": null, "activity_regularizer": null, "nb_filter": 24, "activation": "linear", "init": "glorot_uniform", "bias": true, "nb_col": 5, "dim_ordering": "tf", "batch_input_shape": [null, 66, 200, 1]}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "b_regularizer": null, "nb_row": 5, "trainable": true, "W_constraint": null, "subsample": [2, 2], "name": "convolution2d_2", "b_constraint": null, "input_dtype": "float32", "W_regularizer": null, "activity_regularizer": null, "nb_filter": 36, "activation": "linear", "init": "glorot_uniform", "bias": true, "nb_col": 5, "dim_ordering": "tf", "batch_input_shape": [null, 66, 200, 1]}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "b_regularizer": null, "nb_row": 5, "trainable": true, "W_constraint": null, "subsample": [2, 2], "name": "convolution2d_3", "b_constraint": null, "input_dtype": "float32", "W_regularizer": null, "activity_regularizer": null, "nb_filter": 48, "activation": "linear", "init": "glorot_uniform", "bias": true, "nb_col": 5, "dim_ordering": "tf", "batch_input_shape": [null, 66, 200, 1]}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "b_regularizer": null, "nb_row": 3, "trainable": true, "W_constraint": null, "subsample": [1, 1], "name": "convolution2d_4", "b_constraint": null, "input_dtype": "float32", "W_regularizer": null, "activity_regularizer": null, "nb_filter": 64, "activation": "linear", "init": "glorot_uniform", "bias": true, "nb_col": 3, "dim_ordering": "tf", "batch_input_shape": [null, 66, 200, 1]}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "b_regularizer": null, "nb_row": 3, "trainable": true, "W_constraint": null, "subsample": [1, 1], "name": "convolution2d_5", "b_constraint": null, "input_dtype": "float32", "W_regularizer": null, "activity_regularizer": null, "nb_filter": 64, "activation": "linear", "init": "glorot_uniform", "bias": true, "nb_col": 3, "dim_ordering": "tf", "batch_input_shape": [null, 66, 200, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 100, "b_regularizer": null, "trainable": true, "W_constraint": null, "name": "dense_1", "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "bias": true, "input_dim": 1152}, "class_name": "Dense"}, {"config": {"output_dim": 50, "b_regularizer": null, "trainable": true, "W_constraint": null, "name": "dense_2", "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "bias": true, "input_dim": 100}, "class_name": "Dense"}, {"config": {"output_dim": 10, "b_regularizer": null, "trainable": true, "W_constraint": null, "name": "dense_3", "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "bias": true, "input_dim": 50}, "class_name": "Dense"}, {"config": {"output_dim": 1, "b_regularizer": null, "trainable": true, "W_constraint": null, "name": "dense_4", "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "bias": true, "input_dim": 10}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}