{"config": [{"config": {"nb_row": 5, "init": "glorot_uniform", "name": "convolution2d_1", "batch_input_shape": [null, 160, 320, 3], "dim_ordering": "tf", "activation": "linear", "W_constraint": null, "bias": true, "border_mode": "valid", "input_dtype": "float32", "b_regularizer": null, "nb_col": 5, "b_constraint": null, "nb_filter": 24, "activity_regularizer": null, "subsample": [2, 2], "trainable": true, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"nb_row": 5, "init": "glorot_uniform", "name": "convolution2d_2", "batch_input_shape": [null, 160, 320, 3], "dim_ordering": "tf", "activation": "linear", "W_constraint": null, "bias": true, "border_mode": "valid", "input_dtype": "float32", "b_regularizer": null, "nb_col": 5, "b_constraint": null, "nb_filter": 36, "activity_regularizer": null, "subsample": [2, 2], "trainable": true, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"nb_row": 5, "init": "glorot_uniform", "name": "convolution2d_3", "batch_input_shape": [null, 160, 320, 3], "dim_ordering": "tf", "activation": "linear", "W_constraint": null, "bias": true, "border_mode": "valid", "input_dtype": "float32", "b_regularizer": null, "nb_col": 5, "b_constraint": null, "nb_filter": 48, "activity_regularizer": null, "subsample": [2, 2], "trainable": true, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"nb_row": 3, "init": "glorot_uniform", "name": "convolution2d_4", "batch_input_shape": [null, 160, 320, 3], "dim_ordering": "tf", "activation": "linear", "W_constraint": null, "bias": true, "border_mode": "valid", "input_dtype": "float32", "b_regularizer": null, "nb_col": 3, "b_constraint": null, "nb_filter": 64, "activity_regularizer": null, "subsample": [1, 1], "trainable": true, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"nb_row": 3, "init": "glorot_uniform", "name": "convolution2d_5", "batch_input_shape": [null, 160, 320, 3], "dim_ordering": "tf", "activation": "linear", "W_constraint": null, "bias": true, "border_mode": "valid", "input_dtype": "float32", "b_regularizer": null, "nb_col": 3, "b_constraint": null, "nb_filter": 64, "activity_regularizer": null, "subsample": [1, 1], "trainable": true, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "activation": "linear", "bias": true, "W_regularizer": null, "b_regularizer": null, "output_dim": 100, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "name": "dense_1", "input_dim": 27456, "trainable": true}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "activation": "linear", "bias": true, "W_regularizer": null, "b_regularizer": null, "output_dim": 50, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "name": "dense_2", "input_dim": 100, "trainable": true}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "activation": "linear", "bias": true, "W_regularizer": null, "b_regularizer": null, "output_dim": 10, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "name": "dense_3", "input_dim": 50, "trainable": true}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "activation": "linear", "bias": true, "W_regularizer": null, "b_regularizer": null, "output_dim": 1, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "name": "dense_4", "input_dim": 10, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}