{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "b_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32", "nb_filter": 24, "W_constraint": null, "subsample": [2, 2], "nb_col": 5, "init": "glorot_uniform", "name": "convolution2d_1", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "dim_ordering": "tf", "nb_row": 5, "activation": "linear"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32", "nb_filter": 36, "W_constraint": null, "subsample": [2, 2], "nb_col": 5, "init": "glorot_uniform", "name": "convolution2d_2", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "dim_ordering": "tf", "nb_row": 5, "activation": "linear"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32", "nb_filter": 48, "W_constraint": null, "subsample": [2, 2], "nb_col": 5, "init": "glorot_uniform", "name": "convolution2d_3", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "dim_ordering": "tf", "nb_row": 5, "activation": "linear"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32", "nb_filter": 64, "W_constraint": null, "subsample": [1, 1], "nb_col": 3, "init": "glorot_uniform", "name": "convolution2d_4", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "dim_ordering": "tf", "nb_row": 3, "activation": "linear"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32", "nb_filter": 64, "W_constraint": null, "subsample": [1, 1], "nb_col": 3, "init": "glorot_uniform", "name": "convolution2d_5", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "dim_ordering": "tf", "nb_row": 3, "activation": "linear"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "input_dim": 1152, "activation": "linear", "name": "dense_1", "output_dim": 100, "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "bias": true}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "input_dim": 100, "activation": "linear", "name": "dense_2", "output_dim": 50, "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "bias": true}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "input_dim": 50, "activation": "linear", "name": "dense_3", "output_dim": 10, "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "bias": true}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "input_dim": 10, "activation": "linear", "name": "dense_4", "output_dim": 1, "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "bias": true}}], "keras_version": "1.2.0"}