{"class_name": "Sequential", "config": [{"class_name": "Cropping2D", "config": {"name": "cropping2d_1", "batch_input_shape": [null, 160, 320, 1], "input_dtype": "float32", "trainable": true, "cropping": [[64, 30], [0, 0]]}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "b_constraint": null, "border_mode": "valid", "init": "glorot_uniform", "subsample": [2, 2], "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "W_constraint": null, "nb_filter": 24, "b_regularizer": null, "nb_row": 5, "nb_col": 5, "trainable": true, "bias": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "b_constraint": null, "border_mode": "valid", "init": "glorot_uniform", "subsample": [2, 2], "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "W_constraint": null, "nb_filter": 36, "b_regularizer": null, "nb_row": 5, "nb_col": 5, "trainable": true, "bias": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "b_constraint": null, "border_mode": "valid", "init": "glorot_uniform", "subsample": [2, 2], "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "W_constraint": null, "nb_filter": 48, "b_regularizer": null, "nb_row": 5, "nb_col": 5, "trainable": true, "bias": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "b_constraint": null, "border_mode": "valid", "init": "glorot_uniform", "subsample": [1, 1], "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "W_constraint": null, "nb_filter": 64, "b_regularizer": null, "nb_row": 3, "nb_col": 3, "trainable": true, "bias": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "b_constraint": null, "border_mode": "valid", "init": "glorot_uniform", "subsample": [1, 1], "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "W_constraint": null, "nb_filter": 64, "b_regularizer": null, "nb_row": 3, "nb_col": 3, "trainable": true, "bias": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "b_constraint": null, "output_dim": 100, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "linear", "W_constraint": null, "input_dim": 2112, "b_regularizer": null, "trainable": true, "bias": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "b_constraint": null, "output_dim": 50, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "linear", "W_constraint": null, "input_dim": 100, "b_regularizer": null, "trainable": true, "bias": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "b_constraint": null, "output_dim": 10, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "linear", "W_constraint": null, "input_dim": 50, "b_regularizer": null, "trainable": true, "bias": true}}, {"class_name": "Dense", "config": {"name": "dense_4", "b_constraint": null, "output_dim": 1, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "linear", "W_constraint": null, "input_dim": 10, "b_regularizer": null, "trainable": true, "bias": true}}], "keras_version": "1.2.0"}