{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_filter": 24, "name": "convolution2d_1", "nb_col": 5, "input_dtype": "float32", "batch_input_shape": [null, 66, 200, 1], "activation": "linear", "b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 5, "trainable": true, "border_mode": "valid", "subsample": [2, 2], "bias": true, "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_filter": 36, "trainable": true, "nb_col": 5, "nb_row": 5, "b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "border_mode": "valid", "name": "convolution2d_2", "subsample": [2, 2], "bias": true, "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_filter": 48, "trainable": true, "nb_col": 5, "nb_row": 5, "b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "border_mode": "valid", "name": "convolution2d_3", "subsample": [2, 2], "bias": true, "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_filter": 64, "trainable": true, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "border_mode": "valid", "name": "convolution2d_4", "subsample": [1, 1], "bias": true, "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_filter": 64, "trainable": true, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "border_mode": "valid", "name": "convolution2d_5", "subsample": [1, 1], "bias": true, "b_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "trainable": true, "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "output_dim": 100, "name": "dense_1", "input_dim": 1152}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "trainable": true, "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "output_dim": 50, "name": "dense_2", "input_dim": 100}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "trainable": true, "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "output_dim": 10, "name": "dense_3", "input_dim": 50}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "trainable": true, "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "output_dim": 1, "name": "dense_4", "input_dim": 10}}]}