{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"input_dtype": "float32", "b_regularizer": null, "activation": "linear", "bias": true, "batch_input_shape": [null, 160, 320, 3], "nb_row": 5, "b_constraint": null, "border_mode": "valid", "W_constraint": null, "name": "convolution2d_1", "trainable": true, "activity_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "nb_filter": 24, "dim_ordering": "tf", "nb_col": 5, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"input_dtype": "float32", "b_regularizer": null, "activation": "linear", "bias": true, "batch_input_shape": [null, 160, 320, 3], "nb_row": 5, "b_constraint": null, "border_mode": "valid", "W_constraint": null, "name": "convolution2d_2", "trainable": true, "activity_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "nb_filter": 36, "dim_ordering": "tf", "nb_col": 5, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"input_dtype": "float32", "b_regularizer": null, "activation": "linear", "bias": true, "batch_input_shape": [null, 160, 320, 3], "nb_row": 5, "b_constraint": null, "border_mode": "valid", "W_constraint": null, "name": "convolution2d_3", "trainable": true, "activity_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "nb_filter": 48, "dim_ordering": "tf", "nb_col": 5, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"input_dtype": "float32", "b_regularizer": null, "activation": "linear", "bias": true, "batch_input_shape": [null, 160, 320, 3], "nb_row": 3, "b_constraint": null, "border_mode": "valid", "W_constraint": null, "name": "convolution2d_4", "trainable": true, "activity_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "nb_filter": 64, "dim_ordering": "tf", "nb_col": 3, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"input_dtype": "float32", "b_regularizer": null, "activation": "linear", "bias": true, "batch_input_shape": [null, 160, 320, 3], "nb_row": 3, "b_constraint": null, "border_mode": "valid", "W_constraint": null, "name": "convolution2d_5", "trainable": true, "activity_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "nb_filter": 64, "dim_ordering": "tf", "nb_col": 3, "W_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "linear", "output_dim": 100, "input_dim": 27456, "b_constraint": null, "W_constraint": null, "name": "dense_1", "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "linear", "output_dim": 50, "input_dim": 100, "b_constraint": null, "W_constraint": null, "name": "dense_2", "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "linear", "output_dim": 10, "input_dim": 50, "b_constraint": null, "W_constraint": null, "name": "dense_3", "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "linear", "output_dim": 1, "input_dim": 10, "b_constraint": null, "W_constraint": null, "name": "dense_4", "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null}}], "keras_version": "1.2.0"}