{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Cropping2D", "config": {"input_dtype": "float32", "name": "cropping2d_1", "trainable": true, "cropping": [[64, 30], [0, 0]], "batch_input_shape": [null, 160, 320, 1]}}, {"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function_type": "lambda", "output_shape_type": "raw", "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u009b\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "border_mode": "valid", "W_regularizer": null, "nb_filter": 24, "subsample": [2, 2], "trainable": true, "nb_row": 5, "bias": true, "b_constraint": null, "dim_ordering": "tf", "nb_col": 5, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "border_mode": "valid", "W_regularizer": null, "nb_filter": 36, "subsample": [2, 2], "trainable": true, "nb_row": 5, "bias": true, "b_constraint": null, "dim_ordering": "tf", "nb_col": 5, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.2}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "border_mode": "valid", "W_regularizer": null, "nb_filter": 48, "subsample": [2, 2], "trainable": true, "nb_row": 5, "bias": true, "b_constraint": null, "dim_ordering": "tf", "nb_col": 5, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.2}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "border_mode": "valid", "W_regularizer": null, "nb_filter": 64, "subsample": [1, 1], "trainable": true, "nb_row": 3, "bias": true, "b_constraint": null, "dim_ordering": "tf", "nb_col": 3, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.2}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "border_mode": "valid", "W_regularizer": null, "nb_filter": 64, "subsample": [1, 1], "trainable": true, "nb_row": 3, "bias": true, "b_constraint": null, "dim_ordering": "tf", "nb_col": 3, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "p": 0.2}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "init": "glorot_uniform", "W_constraint": null, "input_dim": 2112, "activity_regularizer": null, "output_dim": 100, "b_regularizer": null, "trainable": true, "bias": true, "b_constraint": null, "W_regularizer": null, "activation": "linear"}}, {"class_name": "Dense", "config": {"name": "dense_2", "init": "glorot_uniform", "W_constraint": null, "input_dim": 100, "activity_regularizer": null, "output_dim": 50, "b_regularizer": null, "trainable": true, "bias": true, "b_constraint": null, "W_regularizer": null, "activation": "linear"}}, {"class_name": "Dense", "config": {"name": "dense_3", "init": "glorot_uniform", "W_constraint": null, "input_dim": 50, "activity_regularizer": null, "output_dim": 10, "b_regularizer": null, "trainable": true, "bias": true, "b_constraint": null, "W_regularizer": null, "activation": "linear"}}, {"class_name": "Dense", "config": {"name": "dense_4", "init": "glorot_uniform", "W_constraint": null, "input_dim": 10, "activity_regularizer": null, "output_dim": 1, "b_regularizer": null, "trainable": true, "bias": true, "b_constraint": null, "W_regularizer": null, "activation": "linear"}}]}