{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 160, 320, 1], "nb_filter": 24, "trainable": true, "subsample": [2, 2], "W_constraint": null, "bias": true, "nb_row": 5, "input_dtype": "float32", "W_regularizer": null, "name": "convolution2d_1", "init": "glorot_uniform", "dim_ordering": "tf", "b_regularizer": null, "nb_col": 5, "border_mode": "valid", "activity_regularizer": null, "activation": "linear", "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 160, 320, 1], "nb_filter": 36, "trainable": true, "subsample": [2, 2], "W_constraint": null, "bias": true, "nb_row": 5, "input_dtype": "float32", "W_regularizer": null, "name": "convolution2d_2", "init": "glorot_uniform", "dim_ordering": "tf", "b_regularizer": null, "nb_col": 5, "border_mode": "valid", "activity_regularizer": null, "activation": "linear", "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 160, 320, 1], "nb_filter": 48, "trainable": true, "subsample": [2, 2], "W_constraint": null, "bias": true, "nb_row": 5, "input_dtype": "float32", "W_regularizer": null, "name": "convolution2d_3", "init": "glorot_uniform", "dim_ordering": "tf", "b_regularizer": null, "nb_col": 5, "border_mode": "valid", "activity_regularizer": null, "activation": "linear", "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 160, 320, 1], "nb_filter": 64, "trainable": true, "subsample": [1, 1], "W_constraint": null, "bias": true, "nb_row": 3, "input_dtype": "float32", "W_regularizer": null, "name": "convolution2d_4", "init": "glorot_uniform", "dim_ordering": "tf", "b_regularizer": null, "nb_col": 3, "border_mode": "valid", "activity_regularizer": null, "activation": "linear", "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 160, 320, 1], "nb_filter": 64, "trainable": true, "subsample": [1, 1], "W_constraint": null, "bias": true, "nb_row": 3, "input_dtype": "float32", "W_regularizer": null, "name": "convolution2d_5", "init": "glorot_uniform", "dim_ordering": "tf", "b_regularizer": null, "nb_col": 3, "border_mode": "valid", "activity_regularizer": null, "activation": "linear", "b_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "W_constraint": null, "W_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "b_regularizer": null, "input_dim": 27456, "bias": true, "output_dim": 100, "activation": "linear", "activity_regularizer": null, "b_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "W_constraint": null, "W_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "b_regularizer": null, "input_dim": 100, "bias": true, "output_dim": 50, "activation": "linear", "activity_regularizer": null, "b_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "W_constraint": null, "W_regularizer": null, "name": "dense_3", "init": "glorot_uniform", "b_regularizer": null, "input_dim": 50, "bias": true, "output_dim": 10, "activation": "linear", "activity_regularizer": null, "b_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "W_constraint": null, "W_regularizer": null, "name": "dense_4", "init": "glorot_uniform", "b_regularizer": null, "input_dim": 10, "bias": true, "output_dim": 1, "activation": "linear", "activity_regularizer": null, "b_constraint": null}}]}