{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"border_mode": "valid", "activation": "linear", "W_regularizer": null, "input_dtype": "float32", "name": "convolution2d_1", "b_constraint": null, "init": "glorot_uniform", "nb_filter": 24, "bias": true, "dim_ordering": "tf", "nb_col": 5, "trainable": true, "batch_input_shape": [null, 160, 320, 3], "W_constraint": null, "activity_regularizer": null, "nb_row": 5, "b_regularizer": null, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "activation": "linear", "W_regularizer": null, "input_dtype": "float32", "name": "convolution2d_2", "b_constraint": null, "init": "glorot_uniform", "nb_filter": 36, "bias": true, "dim_ordering": "tf", "nb_col": 5, "trainable": true, "batch_input_shape": [null, 160, 320, 3], "W_constraint": null, "activity_regularizer": null, "nb_row": 5, "b_regularizer": null, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "activation": "linear", "W_regularizer": null, "input_dtype": "float32", "name": "convolution2d_3", "b_constraint": null, "init": "glorot_uniform", "nb_filter": 48, "bias": true, "dim_ordering": "tf", "nb_col": 5, "trainable": true, "batch_input_shape": [null, 160, 320, 3], "W_constraint": null, "activity_regularizer": null, "nb_row": 5, "b_regularizer": null, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "activation": "linear", "W_regularizer": null, "input_dtype": "float32", "name": "convolution2d_4", "b_constraint": null, "init": "glorot_uniform", "nb_filter": 64, "bias": true, "dim_ordering": "tf", "nb_col": 3, "trainable": true, "batch_input_shape": [null, 160, 320, 3], "W_constraint": null, "activity_regularizer": null, "nb_row": 3, "b_regularizer": null, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "activation": "linear", "W_regularizer": null, "input_dtype": "float32", "name": "convolution2d_5", "b_constraint": null, "init": "glorot_uniform", "nb_filter": 64, "bias": true, "dim_ordering": "tf", "nb_col": 3, "trainable": true, "batch_input_shape": [null, 160, 320, 3], "W_constraint": null, "activity_regularizer": null, "nb_row": 3, "b_regularizer": null, "subsample": [1, 1]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "W_regularizer": null, "name": "dense_1", "b_constraint": null, "init": "glorot_uniform", "input_dim": 27456, "output_dim": 100, "trainable": true, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "bias": true}}, {"class_name": "Dense", "config": {"activation": "linear", "W_regularizer": null, "name": "dense_2", "b_constraint": null, "init": "glorot_uniform", "input_dim": 100, "output_dim": 50, "trainable": true, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "bias": true}}, {"class_name": "Dense", "config": {"activation": "linear", "W_regularizer": null, "name": "dense_3", "b_constraint": null, "init": "glorot_uniform", "input_dim": 50, "output_dim": 10, "trainable": true, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "bias": true}}, {"class_name": "Dense", "config": {"activation": "linear", "W_regularizer": null, "name": "dense_4", "b_constraint": null, "init": "glorot_uniform", "input_dim": 10, "output_dim": 1, "trainable": true, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "bias": true}}]}