{"keras_version": "1.2.0", "config": [{"config": {"batch_input_shape": [null, 160, 320, 3], "name": "cropping2d_1", "trainable": true, "cropping": [[64, 30], [0, 0]], "input_dtype": "float32"}, "class_name": "Cropping2D"}, {"config": {"output_shape_type": "raw", "output_shape": null, "trainable": true, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0099\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "arguments": {}}, "class_name": "Lambda"}, {"config": {"nb_col": 5, "nb_row": 5, "b_constraint": null, "trainable": true, "nb_filter": 24, "name": "convolution2d_1", "bias": true, "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "subsample": [2, 2], "b_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"nb_col": 5, "nb_row": 5, "b_constraint": null, "trainable": true, "nb_filter": 36, "name": "convolution2d_2", "bias": true, "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "subsample": [2, 2], "b_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_2", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"nb_col": 5, "nb_row": 5, "b_constraint": null, "trainable": true, "nb_filter": 48, "name": "convolution2d_3", "bias": true, "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "subsample": [2, 2], "b_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_3", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"nb_col": 3, "nb_row": 3, "b_constraint": null, "trainable": true, "nb_filter": 64, "name": "convolution2d_4", "bias": true, "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "b_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_4", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"nb_col": 3, "nb_row": 3, "b_constraint": null, "trainable": true, "nb_filter": 64, "name": "convolution2d_5", "bias": true, "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "b_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_5", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_5", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_regularizer": null, "b_constraint": null, "trainable": true, "name": "dense_1", "bias": true, "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 100, "W_constraint": null, "input_dim": 2112}, "class_name": "Dense"}, {"config": {"b_regularizer": null, "b_constraint": null, "trainable": true, "name": "dense_2", "bias": true, "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 50, "W_constraint": null, "input_dim": 100}, "class_name": "Dense"}, {"config": {"b_regularizer": null, "b_constraint": null, "trainable": true, "name": "dense_3", "bias": true, "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 10, "W_constraint": null, "input_dim": 50}, "class_name": "Dense"}, {"config": {"b_regularizer": null, "b_constraint": null, "trainable": true, "name": "dense_4", "bias": true, "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 1, "W_constraint": null, "input_dim": 10}, "class_name": "Dense"}], "class_name": "Sequential"}