{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_row": 5, "dim_ordering": "tf", "trainable": true, "activity_regularizer": null, "subsample": [2, 2], "input_dtype": "float32", "bias": true, "b_constraint": null, "W_regularizer": null, "nb_col": 5, "init": "glorot_uniform", "W_constraint": null, "name": "convolution2d_1", "activation": "linear", "border_mode": "valid", "nb_filter": 24, "batch_input_shape": [null, 66, 200, 1], "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "dim_ordering": "tf", "trainable": true, "activity_regularizer": null, "subsample": [2, 2], "input_dtype": "float32", "bias": true, "b_constraint": null, "W_regularizer": null, "nb_col": 5, "init": "glorot_uniform", "W_constraint": null, "name": "convolution2d_2", "activation": "linear", "border_mode": "valid", "nb_filter": 36, "batch_input_shape": [null, 66, 200, 1], "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "dim_ordering": "tf", "trainable": true, "activity_regularizer": null, "subsample": [2, 2], "input_dtype": "float32", "bias": true, "b_constraint": null, "W_regularizer": null, "nb_col": 5, "init": "glorot_uniform", "W_constraint": null, "name": "convolution2d_3", "activation": "linear", "border_mode": "valid", "nb_filter": 48, "batch_input_shape": [null, 66, 200, 1], "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "tf", "trainable": true, "activity_regularizer": null, "subsample": [1, 1], "input_dtype": "float32", "bias": true, "b_constraint": null, "W_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "W_constraint": null, "name": "convolution2d_4", "activation": "linear", "border_mode": "valid", "nb_filter": 64, "batch_input_shape": [null, 66, 200, 1], "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "tf", "trainable": true, "activity_regularizer": null, "subsample": [1, 1], "input_dtype": "float32", "bias": true, "b_constraint": null, "W_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "W_constraint": null, "name": "convolution2d_5", "activation": "linear", "border_mode": "valid", "nb_filter": 64, "batch_input_shape": [null, 66, 200, 1], "b_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "input_dim": 1152, "bias": true, "b_constraint": null, "output_dim": 100, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "name": "dense_1", "activation": "linear", "b_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "input_dim": 100, "bias": true, "b_constraint": null, "output_dim": 50, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "name": "dense_2", "activation": "linear", "b_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "input_dim": 50, "bias": true, "b_constraint": null, "output_dim": 10, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "name": "dense_3", "activation": "linear", "b_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "input_dim": 10, "bias": true, "b_constraint": null, "output_dim": 1, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "name": "dense_4", "activation": "linear", "b_regularizer": null}}], "keras_version": "1.2.0"}