{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Cropping2D", "config": {"cropping": [[64, 30], [0, 0]], "input_dtype": "float32", "batch_input_shape": [null, 160, 320, 1], "name": "cropping2d_1", "trainable": true}}, {"class_name": "Lambda", "config": {"function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u009b\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "output_shape_type": "raw", "output_shape": null, "name": "lambda_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "activation": "linear", "nb_row": 5, "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "nb_filter": 24, "init": "glorot_uniform", "bias": true, "subsample": [2, 2], "border_mode": "valid", "name": "convolution2d_1", "nb_col": 5, "trainable": true, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "activation": "linear", "nb_row": 5, "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "nb_filter": 36, "init": "glorot_uniform", "bias": true, "subsample": [2, 2], "border_mode": "valid", "name": "convolution2d_2", "nb_col": 5, "trainable": true, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "activation": "linear", "nb_row": 5, "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "nb_filter": 48, "init": "glorot_uniform", "bias": true, "subsample": [2, 2], "border_mode": "valid", "name": "convolution2d_3", "nb_col": 5, "trainable": true, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "activation": "linear", "nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "nb_filter": 64, "init": "glorot_uniform", "bias": true, "subsample": [1, 1], "border_mode": "valid", "name": "convolution2d_4", "nb_col": 3, "trainable": true, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "activation": "linear", "nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "nb_filter": 64, "init": "glorot_uniform", "bias": true, "subsample": [1, 1], "border_mode": "valid", "name": "convolution2d_5", "nb_col": 3, "trainable": true, "W_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "linear", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "output_dim": 100, "init": "glorot_uniform", "bias": true, "name": "dense_1", "input_dim": 2112, "trainable": true, "W_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "linear", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "output_dim": 50, "init": "glorot_uniform", "bias": true, "name": "dense_2", "input_dim": 100, "trainable": true, "W_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "linear", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "output_dim": 10, "init": "glorot_uniform", "bias": true, "name": "dense_3", "input_dim": 50, "trainable": true, "W_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "linear", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "output_dim": 1, "init": "glorot_uniform", "bias": true, "name": "dense_4", "input_dim": 10, "trainable": true, "W_regularizer": null}}]}