{"keras_version": "1.2.0", "config": [{"config": {"trainable": true, "cropping": [[64, 30], [0, 0]], "batch_input_shape": [null, 160, 320, 1], "name": "cropping2d_1", "input_dtype": "float32"}, "class_name": "Cropping2D"}, {"config": {"output_shape_type": "raw", "trainable": true, "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u009b\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape": null, "name": "lambda_1"}, "class_name": "Lambda"}, {"config": {"border_mode": "valid", "trainable": true, "dim_ordering": "tf", "nb_col": 5, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_1", "bias": true, "nb_row": 5, "init": "glorot_uniform", "subsample": [2, 2], "nb_filter": 24, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "class_name": "Dropout"}, {"config": {"border_mode": "valid", "trainable": true, "dim_ordering": "tf", "nb_col": 5, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_2", "bias": true, "nb_row": 5, "init": "glorot_uniform", "subsample": [2, 2], "nb_filter": 36, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.2}, "class_name": "Dropout"}, {"config": {"border_mode": "valid", "trainable": true, "dim_ordering": "tf", "nb_col": 5, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_3", "bias": true, "nb_row": 5, "init": "glorot_uniform", "subsample": [2, 2], "nb_filter": 48, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.2}, "class_name": "Dropout"}, {"config": {"border_mode": "valid", "trainable": true, "dim_ordering": "tf", "nb_col": 3, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_4", "bias": true, "nb_row": 3, "init": "glorot_uniform", "subsample": [1, 1], "nb_filter": 64, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.2}, "class_name": "Dropout"}, {"config": {"border_mode": "valid", "trainable": true, "dim_ordering": "tf", "nb_col": 3, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_5", "bias": true, "nb_row": 3, "init": "glorot_uniform", "subsample": [1, 1], "nb_filter": 64, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_5", "p": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "input_dim": 2112, "b_constraint": null, "W_regularizer": null, "bias": true, "activation": "linear", "output_dim": 100, "init": "glorot_uniform", "name": "dense_1"}, "class_name": "Dense"}, {"config": {"trainable": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "input_dim": 100, "b_constraint": null, "W_regularizer": null, "bias": true, "activation": "linear", "output_dim": 50, "init": "glorot_uniform", "name": "dense_2"}, "class_name": "Dense"}, {"config": {"trainable": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "input_dim": 50, "b_constraint": null, "W_regularizer": null, "bias": true, "activation": "linear", "output_dim": 10, "init": "glorot_uniform", "name": "dense_3"}, "class_name": "Dense"}, {"config": {"trainable": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "input_dim": 10, "b_constraint": null, "W_regularizer": null, "bias": true, "activation": "linear", "output_dim": 1, "init": "glorot_uniform", "name": "dense_4"}, "class_name": "Dense"}], "class_name": "Sequential"}