{"config": [{"config": {"name": "cropping2d_1", "batch_input_shape": [null, 160, 320, 1], "input_dtype": "float32", "trainable": true, "cropping": [[64, 30], [0, 0]]}, "class_name": "Cropping2D"}, {"config": {"function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u008a\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "output_shape_type": "raw", "output_shape": null, "trainable": true, "arguments": {}}, "class_name": "Lambda"}, {"config": {"bias": true, "subsample": [2, 2], "name": "convolution2d_1", "nb_col": 5, "border_mode": "valid", "W_constraint": null, "activation": "linear", "nb_row": 5, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "trainable": true, "nb_filter": 24, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"bias": true, "subsample": [2, 2], "name": "convolution2d_2", "nb_col": 5, "border_mode": "valid", "W_constraint": null, "activation": "linear", "nb_row": 5, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "trainable": true, "nb_filter": 36, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"bias": true, "subsample": [2, 2], "name": "convolution2d_3", "nb_col": 5, "border_mode": "valid", "W_constraint": null, "activation": "linear", "nb_row": 5, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "trainable": true, "nb_filter": 48, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"bias": true, "subsample": [1, 1], "name": "convolution2d_4", "nb_col": 3, "border_mode": "valid", "W_constraint": null, "activation": "linear", "nb_row": 3, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "trainable": true, "nb_filter": 64, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"bias": true, "subsample": [1, 1], "name": "convolution2d_5", "nb_col": 3, "border_mode": "valid", "W_constraint": null, "activation": "linear", "nb_row": 3, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "trainable": true, "nb_filter": 64, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias": true, "output_dim": 100, "name": "dense_1", "trainable": true, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "input_dim": 2112}, "class_name": "Dense"}, {"config": {"bias": true, "output_dim": 50, "name": "dense_2", "trainable": true, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "input_dim": 100}, "class_name": "Dense"}, {"config": {"bias": true, "output_dim": 10, "name": "dense_3", "trainable": true, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "input_dim": 50}, "class_name": "Dense"}, {"config": {"bias": true, "output_dim": 1, "name": "dense_4", "trainable": true, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "input_dim": 10}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}