{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"input_dtype": "float32", "activation": "linear", "bias": true, "nb_row": 5, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "border_mode": "valid", "b_constraint": null, "batch_input_shape": [null, 160, 320, 1], "dim_ordering": "tf", "name": "convolution2d_1", "subsample": [2, 2], "nb_filter": 24, "nb_col": 5, "trainable": true, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "activation": "linear", "bias": true, "nb_row": 5, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "b_constraint": null, "nb_filter": 36, "name": "convolution2d_2", "nb_col": 5, "border_mode": "valid", "trainable": true, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "activation": "linear", "bias": true, "nb_row": 5, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "b_constraint": null, "nb_filter": 48, "name": "convolution2d_3", "nb_col": 5, "border_mode": "valid", "trainable": true, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "activation": "linear", "bias": true, "nb_row": 3, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "b_constraint": null, "nb_filter": 64, "name": "convolution2d_4", "nb_col": 3, "border_mode": "valid", "trainable": true, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "activation": "linear", "bias": true, "nb_row": 3, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "b_constraint": null, "nb_filter": 64, "name": "convolution2d_5", "nb_col": 3, "border_mode": "valid", "trainable": true, "b_regularizer": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias": true, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 100, "W_constraint": null, "b_constraint": null, "input_dim": 27456, "name": "dense_1", "trainable": true, "activation": "linear", "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"bias": true, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 50, "W_constraint": null, "b_constraint": null, "input_dim": 100, "name": "dense_2", "trainable": true, "activation": "linear", "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"bias": true, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 10, "W_constraint": null, "b_constraint": null, "input_dim": 50, "name": "dense_3", "trainable": true, "activation": "linear", "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"bias": true, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 1, "W_constraint": null, "b_constraint": null, "input_dim": 10, "name": "dense_4", "trainable": true, "activation": "linear", "W_regularizer": null, "b_regularizer": null}}]}