{"class_name": "Sequential", "config": [{"class_name": "Cropping2D", "config": {"name": "cropping2d_1", "cropping": [[64, 30], [0, 0]], "trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 160, 320, 1]}}, {"class_name": "Lambda", "config": {"name": "lambda_1", "output_shape_type": "raw", "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u009c\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "trainable": true, "output_shape": null}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_constraint": null, "W_regularizer": null, "border_mode": "valid", "nb_row": 5, "init": "glorot_uniform", "nb_filter": 24, "nb_col": 5, "subsample": [2, 2], "name": "convolution2d_1", "b_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "bias": true, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_constraint": null, "W_regularizer": null, "border_mode": "valid", "nb_row": 5, "init": "glorot_uniform", "nb_filter": 36, "nb_col": 5, "subsample": [2, 2], "name": "convolution2d_2", "b_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "bias": true, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_constraint": null, "W_regularizer": null, "border_mode": "valid", "nb_row": 5, "init": "glorot_uniform", "nb_filter": 48, "nb_col": 5, "subsample": [2, 2], "name": "convolution2d_3", "b_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "bias": true, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_constraint": null, "W_regularizer": null, "border_mode": "valid", "nb_row": 3, "init": "glorot_uniform", "nb_filter": 64, "nb_col": 3, "subsample": [1, 1], "name": "convolution2d_4", "b_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "bias": true, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_constraint": null, "W_regularizer": null, "border_mode": "valid", "nb_row": 3, "init": "glorot_uniform", "nb_filter": 64, "nb_col": 3, "subsample": [1, 1], "name": "convolution2d_5", "b_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "bias": true, "b_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": 2112, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 100, "name": "dense_1", "b_constraint": null, "trainable": true, "activation": "linear", "bias": true, "b_regularizer": null}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": 100, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 50, "name": "dense_2", "b_constraint": null, "trainable": true, "activation": "linear", "bias": true, "b_regularizer": null}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": 50, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 10, "name": "dense_3", "b_constraint": null, "trainable": true, "activation": "linear", "bias": true, "b_regularizer": null}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": 10, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 1, "name": "dense_4", "b_constraint": null, "trainable": true, "activation": "linear", "bias": true, "b_regularizer": null}}], "keras_version": "1.2.0"}