{"config": [{"config": {"nb_col": 5, "input_dtype": "float32", "bias": true, "init": "glorot_uniform", "batch_input_shape": [null, 66, 320, 1], "name": "convolution2d_1", "trainable": true, "nb_filter": 24, "subsample": [2, 2], "activation": "linear", "W_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "border_mode": "valid", "W_constraint": null, "nb_row": 5, "activity_regularizer": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"nb_col": 5, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_2", "trainable": true, "b_constraint": null, "nb_filter": 36, "activation": "linear", "W_regularizer": null, "subsample": [2, 2], "b_regularizer": null, "border_mode": "valid", "W_constraint": null, "nb_row": 5, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"nb_col": 5, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_3", "trainable": true, "b_constraint": null, "nb_filter": 48, "activation": "linear", "W_regularizer": null, "subsample": [2, 2], "b_regularizer": null, "border_mode": "valid", "W_constraint": null, "nb_row": 5, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"nb_col": 3, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_4", "trainable": true, "b_constraint": null, "nb_filter": 64, "activation": "linear", "W_regularizer": null, "subsample": [1, 1], "b_regularizer": null, "border_mode": "valid", "W_constraint": null, "nb_row": 3, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"nb_col": 3, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_5", "trainable": true, "b_constraint": null, "nb_filter": 64, "activation": "linear", "W_regularizer": null, "subsample": [1, 1], "b_regularizer": null, "border_mode": "valid", "W_constraint": null, "nb_row": 3, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "name": "dense_1", "trainable": true, "bias": true, "activation": "linear", "W_regularizer": null, "input_dim": 2112, "b_constraint": null, "b_regularizer": null, "output_dim": 100, "W_constraint": null}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "name": "dense_2", "trainable": true, "bias": true, "activation": "linear", "W_regularizer": null, "input_dim": 100, "b_constraint": null, "b_regularizer": null, "output_dim": 50, "W_constraint": null}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "name": "dense_3", "trainable": true, "bias": true, "activation": "linear", "W_regularizer": null, "input_dim": 50, "b_constraint": null, "b_regularizer": null, "output_dim": 10, "W_constraint": null}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "name": "dense_4", "trainable": true, "bias": true, "activation": "linear", "W_regularizer": null, "input_dim": 10, "b_constraint": null, "b_regularizer": null, "output_dim": 1, "W_constraint": null}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}