{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"subsample": [2, 2], "batch_input_shape": [null, 66, 200, 1], "trainable": true, "bias": true, "nb_col": 5, "name": "convolution2d_1", "nb_row": 5, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 24, "activation": "linear", "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "trainable": true, "bias": true, "nb_col": 5, "name": "convolution2d_2", "nb_row": 5, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 36, "activation": "linear", "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "trainable": true, "bias": true, "nb_col": 5, "name": "convolution2d_3", "nb_row": 5, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 48, "activation": "linear", "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "trainable": true, "bias": true, "nb_col": 3, "name": "convolution2d_4", "nb_row": 3, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 64, "activation": "linear", "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "trainable": true, "bias": true, "nb_col": 3, "name": "convolution2d_5", "nb_row": 3, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 64, "activation": "linear", "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "init": "glorot_uniform", "output_dim": 100, "b_regularizer": null, "input_dim": 1152, "activity_regularizer": null, "trainable": true, "activation": "linear", "W_regularizer": null, "bias": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "init": "glorot_uniform", "output_dim": 50, "b_regularizer": null, "input_dim": 100, "activity_regularizer": null, "trainable": true, "activation": "linear", "W_regularizer": null, "bias": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "init": "glorot_uniform", "output_dim": 10, "b_regularizer": null, "input_dim": 50, "activity_regularizer": null, "trainable": true, "activation": "linear", "W_regularizer": null, "bias": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_4", "init": "glorot_uniform", "output_dim": 1, "b_regularizer": null, "input_dim": 10, "activity_regularizer": null, "trainable": true, "activation": "linear", "W_regularizer": null, "bias": true}}]}