{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"input_dtype": "float32", "batch_input_shape": [null, 66, 200, 1], "nb_filter": 24, "border_mode": "valid", "nb_row": 5, "bias": true, "dim_ordering": "tf", "trainable": true, "name": "convolution2d_1", "b_constraint": null, "b_regularizer": null, "nb_col": 5, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "subsample": [2, 2], "activation": "linear"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_filter": 36, "border_mode": "valid", "nb_row": 5, "bias": true, "W_regularizer": null, "trainable": true, "name": "convolution2d_2", "b_constraint": null, "b_regularizer": null, "nb_col": 5, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "subsample": [2, 2], "activation": "linear"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_filter": 48, "border_mode": "valid", "nb_row": 5, "bias": true, "W_regularizer": null, "trainable": true, "name": "convolution2d_3", "b_constraint": null, "b_regularizer": null, "nb_col": 5, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "subsample": [2, 2], "activation": "linear"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_filter": 64, "border_mode": "valid", "nb_row": 3, "bias": true, "W_regularizer": null, "trainable": true, "name": "convolution2d_4", "b_constraint": null, "b_regularizer": null, "nb_col": 3, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "subsample": [1, 1], "activation": "linear"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_filter": 64, "border_mode": "valid", "nb_row": 3, "bias": true, "W_regularizer": null, "trainable": true, "name": "convolution2d_5", "b_constraint": null, "b_regularizer": null, "nb_col": 3, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "subsample": [1, 1], "activation": "linear"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "bias": true, "W_constraint": null, "trainable": true, "name": "dense_1", "b_constraint": null, "b_regularizer": null, "input_dim": 1152, "init": "glorot_uniform", "output_dim": 100, "activation": "linear"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "bias": true, "W_constraint": null, "trainable": true, "name": "dense_2", "b_constraint": null, "b_regularizer": null, "input_dim": 100, "init": "glorot_uniform", "output_dim": 50, "activation": "linear"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "bias": true, "W_constraint": null, "trainable": true, "name": "dense_3", "b_constraint": null, "b_regularizer": null, "input_dim": 50, "init": "glorot_uniform", "output_dim": 10, "activation": "linear"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "bias": true, "W_constraint": null, "trainable": true, "name": "dense_4", "b_constraint": null, "b_regularizer": null, "input_dim": 10, "init": "glorot_uniform", "output_dim": 1, "activation": "linear"}}]}