{"config": [{"config": {"trainable": true, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "bias": true, "dim_ordering": "tf", "nb_filter": 24, "init": "glorot_uniform", "activity_regularizer": null, "subsample": [2, 2], "batch_input_shape": [null, 160, 320, 3], "activation": "linear", "name": "convolution2d_1", "border_mode": "valid", "nb_col": 5, "input_dtype": "float32", "nb_row": 5, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "bias": true, "dim_ordering": "tf", "nb_filter": 36, "init": "glorot_uniform", "activity_regularizer": null, "subsample": [2, 2], "batch_input_shape": [null, 160, 320, 3], "activation": "linear", "name": "convolution2d_2", "border_mode": "valid", "nb_col": 5, "input_dtype": "float32", "nb_row": 5, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "bias": true, "dim_ordering": "tf", "nb_filter": 48, "init": "glorot_uniform", "activity_regularizer": null, "subsample": [2, 2], "batch_input_shape": [null, 160, 320, 3], "activation": "linear", "name": "convolution2d_3", "border_mode": "valid", "nb_col": 5, "input_dtype": "float32", "nb_row": 5, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "bias": true, "dim_ordering": "tf", "nb_filter": 64, "init": "glorot_uniform", "activity_regularizer": null, "subsample": [1, 1], "batch_input_shape": [null, 160, 320, 3], "activation": "linear", "name": "convolution2d_4", "border_mode": "valid", "nb_col": 3, "input_dtype": "float32", "nb_row": 3, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "bias": true, "dim_ordering": "tf", "nb_filter": 64, "init": "glorot_uniform", "activity_regularizer": null, "subsample": [1, 1], "batch_input_shape": [null, 160, 320, 3], "activation": "linear", "name": "convolution2d_5", "border_mode": "valid", "nb_col": 3, "input_dtype": "float32", "nb_row": 3, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "bias": true, "input_dim": 27456, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "name": "dense_1", "output_dim": 100, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "bias": true, "input_dim": 100, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "name": "dense_2", "output_dim": 50, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "bias": true, "input_dim": 50, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "name": "dense_3", "output_dim": 10, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "bias": true, "input_dim": 10, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "name": "dense_4", "output_dim": 1, "W_constraint": null}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}