{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"input_dtype": "float32", "activation": "linear", "subsample": [2, 2], "W_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "border_mode": "valid", "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "dim_ordering": "tf", "bias": true, "nb_row": 5, "name": "convolution2d_1", "b_regularizer": null, "nb_col": 5, "nb_filter": 24, "b_constraint": null, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"input_dtype": "float32", "activation": "linear", "subsample": [2, 2], "W_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "border_mode": "valid", "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "dim_ordering": "tf", "bias": true, "nb_row": 5, "name": "convolution2d_2", "b_regularizer": null, "nb_col": 5, "nb_filter": 36, "b_constraint": null, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"input_dtype": "float32", "activation": "linear", "subsample": [2, 2], "W_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "border_mode": "valid", "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "dim_ordering": "tf", "bias": true, "nb_row": 5, "name": "convolution2d_3", "b_regularizer": null, "nb_col": 5, "nb_filter": 48, "b_constraint": null, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"input_dtype": "float32", "activation": "linear", "subsample": [1, 1], "W_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "border_mode": "valid", "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "dim_ordering": "tf", "bias": true, "nb_row": 3, "name": "convolution2d_4", "b_regularizer": null, "nb_col": 3, "nb_filter": 64, "b_constraint": null, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"input_dtype": "float32", "activation": "linear", "subsample": [1, 1], "W_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "border_mode": "valid", "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "dim_ordering": "tf", "bias": true, "nb_row": 3, "name": "convolution2d_5", "b_regularizer": null, "nb_col": 3, "nb_filter": 64, "b_constraint": null, "W_constraint": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"output_dim": 100, "input_dim": 27456, "activation": "linear", "W_regularizer": null, "name": "dense_1", "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "b_constraint": null, "b_regularizer": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"output_dim": 50, "input_dim": 100, "activation": "linear", "W_regularizer": null, "name": "dense_2", "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "b_constraint": null, "b_regularizer": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"output_dim": 10, "input_dim": 50, "activation": "linear", "W_regularizer": null, "name": "dense_3", "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "b_constraint": null, "b_regularizer": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"output_dim": 1, "input_dim": 10, "activation": "linear", "W_regularizer": null, "name": "dense_4", "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "b_constraint": null, "b_regularizer": null, "W_constraint": null}}]}