{"config": [{"config": {"nb_col": 5, "activation": "linear", "input_dtype": "float32", "b_constraint": null, "nb_row": 5, "name": "convolution2d_1", "bias": true, "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 66, 200, 1], "dim_ordering": "tf", "trainable": true, "b_regularizer": null, "subsample": [2, 2], "nb_filter": 24, "W_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"nb_col": 5, "border_mode": "valid", "b_constraint": null, "nb_row": 5, "name": "convolution2d_2", "init": "glorot_uniform", "bias": true, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "trainable": true, "b_regularizer": null, "subsample": [2, 2], "nb_filter": 36, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"nb_col": 5, "border_mode": "valid", "b_constraint": null, "nb_row": 5, "name": "convolution2d_3", "init": "glorot_uniform", "bias": true, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "trainable": true, "b_regularizer": null, "subsample": [2, 2], "nb_filter": 48, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"nb_col": 3, "border_mode": "valid", "b_constraint": null, "nb_row": 3, "name": "convolution2d_4", "init": "glorot_uniform", "bias": true, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "trainable": true, "b_regularizer": null, "subsample": [1, 1], "nb_filter": 64, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"nb_col": 3, "border_mode": "valid", "b_constraint": null, "nb_row": 3, "name": "convolution2d_5", "init": "glorot_uniform", "bias": true, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "trainable": true, "b_regularizer": null, "subsample": [1, 1], "nb_filter": 64, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "b_constraint": null, "input_dim": 1152, "activation": "linear", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 100}, "class_name": "Dense"}, {"config": {"name": "dense_2", "b_constraint": null, "input_dim": 100, "activation": "linear", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 50}, "class_name": "Dense"}, {"config": {"name": "dense_3", "b_constraint": null, "input_dim": 50, "activation": "linear", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 10}, "class_name": "Dense"}, {"config": {"name": "dense_4", "b_constraint": null, "input_dim": 10, "activation": "linear", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 1}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}