{"keras_version": "1.2.0", "config": [{"config": {"init": "glorot_uniform", "nb_row": 5, "subsample": [2, 2], "nb_col": 5, "input_dtype": "float32", "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "b_constraint": null, "trainable": true, "name": "convolution2d_1", "batch_input_shape": [null, 66, 200, 1], "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 24, "border_mode": "valid", "W_constraint": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"init": "glorot_uniform", "nb_row": 5, "subsample": [2, 2], "nb_col": 5, "activation": "linear", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "trainable": true, "name": "convolution2d_2", "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 36, "border_mode": "valid", "bias": true, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"init": "glorot_uniform", "nb_row": 5, "subsample": [2, 2], "nb_col": 5, "activation": "linear", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "trainable": true, "name": "convolution2d_3", "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 48, "border_mode": "valid", "bias": true, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"init": "glorot_uniform", "nb_row": 3, "subsample": [1, 1], "nb_col": 3, "activation": "linear", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "trainable": true, "name": "convolution2d_4", "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "border_mode": "valid", "bias": true, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"init": "glorot_uniform", "nb_row": 3, "subsample": [1, 1], "nb_col": 3, "activation": "linear", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "trainable": true, "name": "convolution2d_5", "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "border_mode": "valid", "bias": true, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "activation": "linear", "trainable": true, "name": "dense_1", "output_dim": 100, "W_regularizer": null, "bias": true, "W_constraint": null, "input_dim": 1152}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "activation": "linear", "trainable": true, "name": "dense_2", "output_dim": 50, "W_regularizer": null, "bias": true, "W_constraint": null, "input_dim": 100}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "activation": "linear", "trainable": true, "name": "dense_3", "output_dim": 10, "W_regularizer": null, "bias": true, "W_constraint": null, "input_dim": 50}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "activation": "linear", "trainable": true, "name": "dense_4", "output_dim": 1, "W_regularizer": null, "bias": true, "W_constraint": null, "input_dim": 10}, "class_name": "Dense"}], "class_name": "Sequential"}