{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Cropping2D", "config": {"trainable": true, "name": "cropping2d_1", "input_dtype": "float32", "batch_input_shape": [null, 160, 320, 1], "cropping": [[64, 30], [0, 0]]}}, {"class_name": "Lambda", "config": {"output_shape_type": "raw", "trainable": true, "output_shape": null, "name": "lambda_1", "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0095\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}}}, {"class_name": "Convolution2D", "config": {"trainable": true, "bias": true, "nb_row": 5, "name": "convolution2d_1", "nb_col": 5, "dim_ordering": "tf", "W_regularizer": null, "border_mode": "valid", "nb_filter": 24, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "subsample": [2, 2], "W_constraint": null, "activation": "linear"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "bias": true, "nb_row": 5, "name": "convolution2d_2", "nb_col": 5, "dim_ordering": "tf", "W_regularizer": null, "border_mode": "valid", "nb_filter": 36, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "subsample": [2, 2], "W_constraint": null, "activation": "linear"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "bias": true, "nb_row": 5, "name": "convolution2d_3", "nb_col": 5, "dim_ordering": "tf", "W_regularizer": null, "border_mode": "valid", "nb_filter": 48, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "subsample": [2, 2], "W_constraint": null, "activation": "linear"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "bias": true, "nb_row": 3, "name": "convolution2d_4", "nb_col": 3, "dim_ordering": "tf", "W_regularizer": null, "border_mode": "valid", "nb_filter": 64, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "activation": "linear"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "bias": true, "nb_row": 3, "name": "convolution2d_5", "nb_col": 3, "dim_ordering": "tf", "W_regularizer": null, "border_mode": "valid", "nb_filter": 64, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "activation": "linear"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "bias": true, "name": "dense_1", "input_dim": 2112, "output_dim": 100, "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "activation": "linear", "W_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "bias": true, "name": "dense_2", "input_dim": 100, "output_dim": 50, "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "activation": "linear", "W_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "bias": true, "name": "dense_3", "input_dim": 50, "output_dim": 10, "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "activation": "linear", "W_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "bias": true, "name": "dense_4", "input_dim": 10, "output_dim": 1, "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "activation": "linear", "W_constraint": null}}]}