{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_regularizer": null, "input_dtype": "float32", "border_mode": "valid", "dim_ordering": "tf", "activity_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "activation": "linear", "b_constraint": null, "W_constraint": null, "subsample": [2, 2], "init": "glorot_uniform", "nb_col": 5, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 24, "nb_row": 5, "name": "convolution2d_1"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "input_dtype": "float32", "border_mode": "valid", "dim_ordering": "tf", "activity_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "activation": "linear", "b_constraint": null, "W_constraint": null, "subsample": [2, 2], "init": "glorot_uniform", "nb_col": 5, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 36, "nb_row": 5, "name": "convolution2d_2"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "input_dtype": "float32", "border_mode": "valid", "dim_ordering": "tf", "activity_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "activation": "linear", "b_constraint": null, "W_constraint": null, "subsample": [2, 2], "init": "glorot_uniform", "nb_col": 5, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 48, "nb_row": 5, "name": "convolution2d_3"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "input_dtype": "float32", "border_mode": "valid", "dim_ordering": "tf", "activity_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "activation": "linear", "b_constraint": null, "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 64, "nb_row": 3, "name": "convolution2d_4"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "input_dtype": "float32", "border_mode": "valid", "dim_ordering": "tf", "activity_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "activation": "linear", "b_constraint": null, "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 64, "nb_row": 3, "name": "convolution2d_5"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "input_dim": 27456, "activity_regularizer": null, "activation": "linear", "trainable": true, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 100, "bias": true, "name": "dense_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "input_dim": 100, "activity_regularizer": null, "activation": "linear", "trainable": true, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 50, "bias": true, "name": "dense_2"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "input_dim": 50, "activity_regularizer": null, "activation": "linear", "trainable": true, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 10, "bias": true, "name": "dense_3"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "input_dim": 10, "activity_regularizer": null, "activation": "linear", "trainable": true, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 1, "bias": true, "name": "dense_4"}}]}