{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_regularizer": null, "activity_regularizer": null, "input_dtype": "float32", "subsample": [2, 2], "b_constraint": null, "nb_col": 5, "nb_row": 5, "b_regularizer": null, "activation": "linear", "bias": true, "trainable": true, "border_mode": "valid", "nb_filter": 24, "init": "glorot_uniform", "W_constraint": null, "dim_ordering": "tf", "batch_input_shape": [null, 66, 200, 1], "name": "convolution2d_1"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "activity_regularizer": null, "subsample": [2, 2], "b_constraint": null, "nb_col": 5, "nb_row": 5, "b_regularizer": null, "activation": "linear", "bias": true, "trainable": true, "border_mode": "valid", "name": "convolution2d_2", "init": "glorot_uniform", "W_constraint": null, "dim_ordering": "tf", "nb_filter": 36}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "activity_regularizer": null, "subsample": [2, 2], "b_constraint": null, "nb_col": 5, "nb_row": 5, "b_regularizer": null, "activation": "linear", "bias": true, "trainable": true, "border_mode": "valid", "name": "convolution2d_3", "init": "glorot_uniform", "W_constraint": null, "dim_ordering": "tf", "nb_filter": 48}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "activity_regularizer": null, "subsample": [1, 1], "b_constraint": null, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "activation": "linear", "bias": true, "trainable": true, "border_mode": "valid", "name": "convolution2d_4", "init": "glorot_uniform", "W_constraint": null, "dim_ordering": "tf", "nb_filter": 64}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "activity_regularizer": null, "subsample": [1, 1], "b_constraint": null, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "activation": "linear", "bias": true, "trainable": true, "border_mode": "valid", "name": "convolution2d_5", "init": "glorot_uniform", "W_constraint": null, "dim_ordering": "tf", "nb_filter": 64}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "activity_regularizer": null, "output_dim": 100, "W_constraint": null, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "trainable": true, "name": "dense_1", "init": "glorot_uniform", "bias": true, "input_dim": 1152}}, {"class_name": "Dense", "config": {"activation": "linear", "activity_regularizer": null, "output_dim": 50, "W_constraint": null, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "trainable": true, "name": "dense_2", "init": "glorot_uniform", "bias": true, "input_dim": 100}}, {"class_name": "Dense", "config": {"activation": "linear", "activity_regularizer": null, "output_dim": 10, "W_constraint": null, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "trainable": true, "name": "dense_3", "init": "glorot_uniform", "bias": true, "input_dim": 50}}, {"class_name": "Dense", "config": {"activation": "linear", "activity_regularizer": null, "output_dim": 1, "W_constraint": null, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "trainable": true, "name": "dense_4", "init": "glorot_uniform", "bias": true, "input_dim": 10}}], "keras_version": "1.2.0"}