{"config": [{"config": {"nb_filter": 24, "subsample": [2, 2], "trainable": true, "bias": true, "input_dtype": "float32", "W_regularizer": null, "init": "glorot_uniform", "batch_input_shape": [null, 66, 200, 1], "border_mode": "valid", "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_1", "nb_col": 5, "dim_ordering": "tf", "nb_row": 5, "activation": "linear", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 36, "subsample": [2, 2], "trainable": true, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_2", "nb_col": 5, "dim_ordering": "tf", "nb_row": 5, "activation": "linear", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 48, "subsample": [2, 2], "trainable": true, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_3", "nb_col": 5, "dim_ordering": "tf", "nb_row": 5, "activation": "linear", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 64, "subsample": [1, 1], "trainable": true, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_4", "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "activation": "linear", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 64, "subsample": [1, 1], "trainable": true, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_5", "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "activation": "linear", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 100, "trainable": true, "bias": true, "init": "glorot_uniform", "input_dim": 1152, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "name": "dense_1", "W_regularizer": null, "activation": "linear", "b_constraint": null}, "class_name": "Dense"}, {"config": {"output_dim": 50, "trainable": true, "bias": true, "init": "glorot_uniform", "input_dim": 100, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "name": "dense_2", "W_regularizer": null, "activation": "linear", "b_constraint": null}, "class_name": "Dense"}, {"config": {"output_dim": 10, "trainable": true, "bias": true, "init": "glorot_uniform", "input_dim": 50, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "name": "dense_3", "W_regularizer": null, "activation": "linear", "b_constraint": null}, "class_name": "Dense"}, {"config": {"output_dim": 1, "trainable": true, "bias": true, "init": "glorot_uniform", "input_dim": 10, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "name": "dense_4", "W_regularizer": null, "activation": "linear", "b_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}