{"class_name": "Sequential", "config": [{"class_name": "Cropping2D", "config": {"input_dtype": "float32", "cropping": [[64, 30], [0, 0]], "batch_input_shape": [null, 160, 320, 1], "name": "cropping2d_1", "trainable": true}}, {"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u009b\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "output_shape": null, "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "init": "glorot_uniform", "border_mode": "valid", "name": "convolution2d_1", "W_constraint": null, "b_constraint": null, "activation": "linear", "nb_filter": 24, "nb_col": 5, "subsample": [2, 2], "nb_row": 5, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "init": "glorot_uniform", "border_mode": "valid", "name": "convolution2d_2", "W_constraint": null, "b_constraint": null, "activation": "linear", "nb_filter": 36, "nb_col": 5, "subsample": [2, 2], "nb_row": 5, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "init": "glorot_uniform", "border_mode": "valid", "name": "convolution2d_3", "W_constraint": null, "b_constraint": null, "activation": "linear", "nb_filter": 48, "nb_col": 5, "subsample": [2, 2], "nb_row": 5, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "init": "glorot_uniform", "border_mode": "valid", "name": "convolution2d_4", "W_constraint": null, "b_constraint": null, "activation": "linear", "nb_filter": 64, "nb_col": 3, "subsample": [1, 1], "nb_row": 3, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "init": "glorot_uniform", "border_mode": "valid", "name": "convolution2d_5", "W_constraint": null, "b_constraint": null, "activation": "linear", "nb_filter": 64, "nb_col": 3, "subsample": [1, 1], "nb_row": 3, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "output_dim": 100, "name": "dense_1", "b_constraint": null, "activation": "linear", "input_dim": 2112, "bias": true, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "output_dim": 50, "name": "dense_2", "b_constraint": null, "activation": "linear", "input_dim": 100, "bias": true, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "output_dim": 10, "name": "dense_3", "b_constraint": null, "activation": "linear", "input_dim": 50, "bias": true, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "output_dim": 1, "name": "dense_4", "b_constraint": null, "activation": "linear", "input_dim": 10, "bias": true, "activity_regularizer": null, "b_regularizer": null}}], "keras_version": "1.2.0"}