{"config": [{"config": {"b_constraint": null, "b_regularizer": null, "border_mode": "valid", "W_constraint": null, "name": "convolution2d_1", "subsample": [2, 2], "input_dtype": "float32", "dim_ordering": "tf", "nb_col": 2, "nb_filter": 24, "nb_row": 2, "init": "glorot_uniform", "activity_regularizer": null, "batch_input_shape": [null, 40, 160, 1], "trainable": true, "bias": true, "activation": "linear", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "b_regularizer": null, "border_mode": "valid", "nb_filter": 36, "name": "convolution2d_2", "subsample": [2, 2], "dim_ordering": "tf", "nb_col": 2, "W_constraint": null, "nb_row": 2, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "bias": true, "activation": "linear", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "b_regularizer": null, "border_mode": "valid", "nb_filter": 48, "name": "convolution2d_3", "subsample": [2, 2], "dim_ordering": "tf", "nb_col": 2, "W_constraint": null, "nb_row": 2, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "bias": true, "activation": "linear", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "b_regularizer": null, "border_mode": "valid", "nb_filter": 64, "name": "convolution2d_4", "subsample": [1, 1], "dim_ordering": "tf", "nb_col": 2, "W_constraint": null, "nb_row": 2, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "bias": true, "activation": "linear", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "b_regularizer": null, "border_mode": "valid", "nb_filter": 64, "name": "convolution2d_5", "subsample": [1, 1], "dim_ordering": "tf", "nb_col": 2, "W_constraint": null, "nb_row": 2, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "bias": true, "activation": "linear", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "b_regularizer": null, "W_constraint": null, "name": "dense_1", "activation": "linear", "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 100, "input_dim": 3456, "bias": true, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"b_constraint": null, "b_regularizer": null, "W_constraint": null, "name": "dense_2", "activation": "linear", "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 50, "input_dim": 100, "bias": true, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"b_constraint": null, "b_regularizer": null, "W_constraint": null, "name": "dense_3", "activation": "linear", "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 10, "input_dim": 50, "bias": true, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"b_constraint": null, "b_regularizer": null, "W_constraint": null, "name": "dense_4", "activation": "linear", "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 1, "input_dim": 10, "bias": true, "W_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}