{"config": [{"config": {"batch_input_shape": [null, 160, 320, 1], "W_regularizer": null, "subsample": [2, 2], "name": "convolution2d_1", "W_constraint": null, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "input_dtype": "float32", "dim_ordering": "tf", "nb_filter": 24, "nb_row": 5, "border_mode": "valid", "b_constraint": null, "nb_col": 5, "bias": true, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"batch_input_shape": [null, 160, 320, 1], "W_regularizer": null, "subsample": [2, 2], "name": "convolution2d_2", "W_constraint": null, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "input_dtype": "float32", "dim_ordering": "tf", "nb_filter": 36, "nb_row": 5, "border_mode": "valid", "b_constraint": null, "nb_col": 5, "bias": true, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"batch_input_shape": [null, 160, 320, 1], "W_regularizer": null, "subsample": [2, 2], "name": "convolution2d_3", "W_constraint": null, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "input_dtype": "float32", "dim_ordering": "tf", "nb_filter": 48, "nb_row": 5, "border_mode": "valid", "b_constraint": null, "nb_col": 5, "bias": true, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"batch_input_shape": [null, 160, 320, 1], "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_4", "W_constraint": null, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "input_dtype": "float32", "dim_ordering": "tf", "nb_filter": 64, "nb_row": 3, "border_mode": "valid", "b_constraint": null, "nb_col": 3, "bias": true, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"batch_input_shape": [null, 160, 320, 1], "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_5", "W_constraint": null, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "input_dtype": "float32", "dim_ordering": "tf", "nb_filter": 64, "nb_row": 3, "border_mode": "valid", "b_constraint": null, "nb_col": 3, "bias": true, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "name": "dense_1", "input_dim": 27456, "W_constraint": null, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "output_dim": 100, "bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "name": "dense_2", "input_dim": 100, "W_constraint": null, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "output_dim": 50, "bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "name": "dense_3", "input_dim": 50, "W_constraint": null, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "output_dim": 10, "bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "name": "dense_4", "input_dim": 10, "W_constraint": null, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "output_dim": 1, "bias": true, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}