{"keras_version": "1.2.0", "config": [{"config": {"batch_input_shape": [null, 66, 200, 1], "nb_col": 5, "trainable": true, "border_mode": "valid", "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 24, "input_dtype": "float32", "nb_row": 5, "bias": true, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "dim_ordering": "tf", "name": "convolution2d_1", "subsample": [2, 2], "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"batch_input_shape": [null, 66, 200, 1], "nb_col": 5, "trainable": true, "border_mode": "valid", "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 36, "input_dtype": "float32", "nb_row": 5, "bias": true, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "dim_ordering": "tf", "name": "convolution2d_2", "subsample": [2, 2], "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"batch_input_shape": [null, 66, 200, 1], "nb_col": 5, "trainable": true, "border_mode": "valid", "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 48, "input_dtype": "float32", "nb_row": 5, "bias": true, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "dim_ordering": "tf", "name": "convolution2d_3", "subsample": [2, 2], "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"batch_input_shape": [null, 66, 200, 1], "nb_col": 3, "trainable": true, "border_mode": "valid", "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 64, "input_dtype": "float32", "nb_row": 3, "bias": true, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "dim_ordering": "tf", "name": "convolution2d_4", "subsample": [1, 1], "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"batch_input_shape": [null, 66, 200, 1], "nb_col": 3, "trainable": true, "border_mode": "valid", "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 64, "input_dtype": "float32", "nb_row": 3, "bias": true, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "dim_ordering": "tf", "name": "convolution2d_5", "subsample": [1, 1], "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"input_dim": 1152, "trainable": true, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "output_dim": 100, "bias": true, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"input_dim": 100, "trainable": true, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "output_dim": 50, "bias": true, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"input_dim": 50, "trainable": true, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "output_dim": 10, "bias": true, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"input_dim": 10, "trainable": true, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "output_dim": 1, "bias": true, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}