{"config": [{"config": {"b_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "name": "convolution2d_1", "nb_row": 5, "subsample": [2, 2], "trainable": true, "b_constraint": null, "activity_regularizer": null, "input_dtype": "float32", "nb_col": 5, "bias": true, "border_mode": "valid", "nb_filter": 24, "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "init": "glorot_uniform", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "name": "convolution2d_2", "nb_row": 5, "subsample": [2, 2], "trainable": true, "b_constraint": null, "activity_regularizer": null, "input_dtype": "float32", "nb_col": 5, "bias": true, "border_mode": "valid", "nb_filter": 36, "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "init": "glorot_uniform", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "name": "convolution2d_3", "nb_row": 5, "subsample": [2, 2], "trainable": true, "b_constraint": null, "activity_regularizer": null, "input_dtype": "float32", "nb_col": 5, "bias": true, "border_mode": "valid", "nb_filter": 48, "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "init": "glorot_uniform", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "name": "convolution2d_4", "nb_row": 3, "subsample": [1, 1], "trainable": true, "b_constraint": null, "activity_regularizer": null, "input_dtype": "float32", "nb_col": 3, "bias": true, "border_mode": "valid", "nb_filter": 64, "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "init": "glorot_uniform", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "name": "convolution2d_5", "nb_row": 3, "subsample": [1, 1], "trainable": true, "b_constraint": null, "activity_regularizer": null, "input_dtype": "float32", "nb_col": 3, "bias": true, "border_mode": "valid", "nb_filter": 64, "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "init": "glorot_uniform", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_regularizer": null, "name": "dense_1", "output_dim": 100, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "bias": true, "input_dim": 27456, "activation": "linear", "W_constraint": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"b_regularizer": null, "name": "dense_2", "output_dim": 50, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "bias": true, "input_dim": 100, "activation": "linear", "W_constraint": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"b_regularizer": null, "name": "dense_3", "output_dim": 10, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "bias": true, "input_dim": 50, "activation": "linear", "W_constraint": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"b_regularizer": null, "name": "dense_4", "output_dim": 1, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "bias": true, "input_dim": 10, "activation": "linear", "W_constraint": null, "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}