{"config": [{"config": {"border_mode": "valid", "W_regularizer": null, "nb_row": 5, "subsample": [2, 2], "init": "glorot_uniform", "batch_input_shape": [null, 160, 320, 3], "activity_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "nb_col": 5, "bias": true, "W_constraint": null, "input_dtype": "float32", "activation": "linear", "nb_filter": 24, "name": "convolution2d_1", "trainable": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "W_regularizer": null, "nb_row": 5, "subsample": [2, 2], "init": "glorot_uniform", "batch_input_shape": [null, 160, 320, 3], "activity_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "nb_col": 5, "bias": true, "W_constraint": null, "input_dtype": "float32", "activation": "linear", "nb_filter": 36, "name": "convolution2d_2", "trainable": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "W_regularizer": null, "nb_row": 5, "subsample": [2, 2], "init": "glorot_uniform", "batch_input_shape": [null, 160, 320, 3], "activity_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "nb_col": 5, "bias": true, "W_constraint": null, "input_dtype": "float32", "activation": "linear", "nb_filter": 48, "name": "convolution2d_3", "trainable": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "init": "glorot_uniform", "batch_input_shape": [null, 160, 320, 3], "activity_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "nb_col": 3, "bias": true, "W_constraint": null, "input_dtype": "float32", "activation": "linear", "nb_filter": 64, "name": "convolution2d_4", "trainable": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "init": "glorot_uniform", "batch_input_shape": [null, 160, 320, 3], "activity_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "nb_col": 3, "bias": true, "W_constraint": null, "input_dtype": "float32", "activation": "linear", "nb_filter": 64, "name": "convolution2d_5", "trainable": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "bias": true, "name": "dense_1", "output_dim": 100, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "input_dim": 27456, "trainable": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "bias": true, "name": "dense_2", "output_dim": 50, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "input_dim": 100, "trainable": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "bias": true, "name": "dense_3", "output_dim": 10, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "input_dim": 50, "trainable": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "bias": true, "name": "dense_4", "output_dim": 1, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "input_dim": 10, "trainable": true, "b_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}