{"config": [{"config": {"subsample": [2, 2], "W_constraint": null, "name": "convolution2d_1", "nb_col": 5, "W_regularizer": null, "bias": true, "nb_row": 5, "b_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "init": "glorot_uniform", "activation": "linear", "input_dtype": "float32", "nb_filter": 24, "b_constraint": null, "border_mode": "valid", "trainable": true, "activity_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"subsample": [2, 2], "W_constraint": null, "name": "convolution2d_2", "nb_col": 5, "W_regularizer": null, "bias": true, "nb_row": 5, "b_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "init": "glorot_uniform", "activation": "linear", "input_dtype": "float32", "nb_filter": 36, "b_constraint": null, "border_mode": "valid", "trainable": true, "activity_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"subsample": [2, 2], "W_constraint": null, "name": "convolution2d_3", "nb_col": 5, "W_regularizer": null, "bias": true, "nb_row": 5, "b_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "init": "glorot_uniform", "activation": "linear", "input_dtype": "float32", "nb_filter": 48, "b_constraint": null, "border_mode": "valid", "trainable": true, "activity_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"subsample": [1, 1], "W_constraint": null, "name": "convolution2d_4", "nb_col": 3, "W_regularizer": null, "bias": true, "nb_row": 3, "b_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "init": "glorot_uniform", "activation": "linear", "input_dtype": "float32", "nb_filter": 64, "b_constraint": null, "border_mode": "valid", "trainable": true, "activity_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"subsample": [1, 1], "W_constraint": null, "name": "convolution2d_5", "nb_col": 3, "W_regularizer": null, "bias": true, "nb_row": 3, "b_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "init": "glorot_uniform", "activation": "linear", "input_dtype": "float32", "nb_filter": 64, "b_constraint": null, "border_mode": "valid", "trainable": true, "activity_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "W_constraint": null, "name": "dense_1", "W_regularizer": null, "bias": true, "activation": "linear", "input_dim": 27456, "output_dim": 100, "b_regularizer": null, "b_constraint": null, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "W_constraint": null, "name": "dense_2", "W_regularizer": null, "bias": true, "activation": "linear", "input_dim": 100, "output_dim": 50, "b_regularizer": null, "b_constraint": null, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "W_constraint": null, "name": "dense_3", "W_regularizer": null, "bias": true, "activation": "linear", "input_dim": 50, "output_dim": 10, "b_regularizer": null, "b_constraint": null, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "W_constraint": null, "name": "dense_4", "W_regularizer": null, "bias": true, "activation": "linear", "input_dim": 10, "output_dim": 1, "b_regularizer": null, "b_constraint": null, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}