{"keras_version": "1.2.0", "config": [{"config": {"trainable": true, "batch_input_shape": [null, 160, 320, 3], "activation": "linear", "activity_regularizer": null, "b_constraint": null, "nb_filter": 24, "b_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 5, "name": "convolution2d_1", "W_regularizer": null, "nb_col": 5, "W_constraint": null, "border_mode": "valid", "bias": true, "input_dtype": "float32"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "batch_input_shape": [null, 160, 320, 3], "activation": "linear", "activity_regularizer": null, "b_constraint": null, "nb_filter": 36, "b_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 5, "name": "convolution2d_2", "W_regularizer": null, "nb_col": 5, "W_constraint": null, "border_mode": "valid", "bias": true, "input_dtype": "float32"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "batch_input_shape": [null, 160, 320, 3], "activation": "linear", "activity_regularizer": null, "b_constraint": null, "nb_filter": 48, "b_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 5, "name": "convolution2d_3", "W_regularizer": null, "nb_col": 5, "W_constraint": null, "border_mode": "valid", "bias": true, "input_dtype": "float32"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "batch_input_shape": [null, 160, 320, 3], "activation": "linear", "activity_regularizer": null, "b_constraint": null, "nb_filter": 64, "b_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_4", "W_regularizer": null, "nb_col": 3, "W_constraint": null, "border_mode": "valid", "bias": true, "input_dtype": "float32"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "batch_input_shape": [null, 160, 320, 3], "activation": "linear", "activity_regularizer": null, "b_constraint": null, "nb_filter": 64, "b_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_5", "W_regularizer": null, "nb_col": 3, "W_constraint": null, "border_mode": "valid", "bias": true, "input_dtype": "float32"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "output_dim": 100, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "input_dim": 27456, "name": "dense_1", "W_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "output_dim": 50, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "input_dim": 100, "name": "dense_2", "W_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "output_dim": 10, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "input_dim": 50, "name": "dense_3", "W_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "output_dim": 1, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "input_dim": 10, "name": "dense_4", "W_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}