{"config": [{"config": {"W_constraint": null, "init": "glorot_uniform", "subsample": [2, 2], "name": "convolution2d_1", "nb_col": 5, "bias": true, "input_dtype": "float32", "activation": "linear", "border_mode": "valid", "batch_input_shape": [null, 160, 320, 3], "dim_ordering": "tf", "trainable": true, "nb_filter": 24, "nb_row": 5, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "subsample": [2, 2], "name": "convolution2d_2", "nb_col": 5, "bias": true, "input_dtype": "float32", "activation": "linear", "border_mode": "valid", "batch_input_shape": [null, 160, 320, 3], "dim_ordering": "tf", "trainable": true, "nb_filter": 36, "nb_row": 5, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "subsample": [2, 2], "name": "convolution2d_3", "nb_col": 5, "bias": true, "input_dtype": "float32", "activation": "linear", "border_mode": "valid", "batch_input_shape": [null, 160, 320, 3], "dim_ordering": "tf", "trainable": true, "nb_filter": 48, "nb_row": 5, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "name": "convolution2d_4", "nb_col": 3, "bias": true, "input_dtype": "float32", "activation": "linear", "border_mode": "valid", "batch_input_shape": [null, 160, 320, 3], "dim_ordering": "tf", "trainable": true, "nb_filter": 64, "nb_row": 3, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "name": "convolution2d_5", "nb_col": 3, "bias": true, "input_dtype": "float32", "activation": "linear", "border_mode": "valid", "batch_input_shape": [null, 160, 320, 3], "dim_ordering": "tf", "trainable": true, "nb_filter": 64, "nb_row": 3, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "output_dim": 100, "name": "dense_1", "bias": true, "activation": "linear", "b_regularizer": null, "trainable": true, "b_constraint": null, "activity_regularizer": null, "input_dim": 27456, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "output_dim": 50, "name": "dense_2", "bias": true, "activation": "linear", "b_regularizer": null, "trainable": true, "b_constraint": null, "activity_regularizer": null, "input_dim": 100, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "output_dim": 10, "name": "dense_3", "bias": true, "activation": "linear", "b_regularizer": null, "trainable": true, "b_constraint": null, "activity_regularizer": null, "input_dim": 50, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "output_dim": 1, "name": "dense_4", "bias": true, "activation": "linear", "b_regularizer": null, "trainable": true, "b_constraint": null, "activity_regularizer": null, "input_dim": 10, "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}