{"config": [{"config": {"b_constraint": null, "nb_filter": 24, "batch_input_shape": [null, 66, 320, 1], "init": "glorot_uniform", "name": "convolution2d_1", "input_dtype": "float32", "activity_regularizer": null, "nb_col": 5, "b_regularizer": null, "border_mode": "valid", "trainable": true, "nb_row": 5, "bias": true, "activation": "linear", "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "nb_filter": 36, "init": "glorot_uniform", "name": "convolution2d_2", "activity_regularizer": null, "nb_col": 5, "b_regularizer": null, "border_mode": "valid", "trainable": true, "nb_row": 5, "bias": true, "activation": "linear", "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "nb_filter": 48, "init": "glorot_uniform", "name": "convolution2d_3", "activity_regularizer": null, "nb_col": 5, "b_regularizer": null, "border_mode": "valid", "trainable": true, "nb_row": 5, "bias": true, "activation": "linear", "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "nb_filter": 64, "init": "glorot_uniform", "name": "convolution2d_4", "activity_regularizer": null, "nb_col": 3, "b_regularizer": null, "border_mode": "valid", "trainable": true, "nb_row": 3, "bias": true, "activation": "linear", "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "nb_filter": 64, "init": "glorot_uniform", "name": "convolution2d_5", "activity_regularizer": null, "nb_col": 3, "b_regularizer": null, "border_mode": "valid", "trainable": true, "nb_row": 3, "bias": true, "activation": "linear", "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_regularizer": null, "name": "dense_1", "activity_regularizer": null, "output_dim": 100, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "bias": true, "activation": "linear", "W_regularizer": null, "W_constraint": null, "input_dim": 2112}, "class_name": "Dense"}, {"config": {"b_regularizer": null, "name": "dense_2", "activity_regularizer": null, "output_dim": 50, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "bias": true, "activation": "linear", "W_regularizer": null, "W_constraint": null, "input_dim": 100}, "class_name": "Dense"}, {"config": {"b_regularizer": null, "name": "dense_3", "activity_regularizer": null, "output_dim": 10, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "bias": true, "activation": "linear", "W_regularizer": null, "W_constraint": null, "input_dim": 50}, "class_name": "Dense"}, {"config": {"b_regularizer": null, "name": "dense_4", "activity_regularizer": null, "output_dim": 1, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "bias": true, "activation": "linear", "W_regularizer": null, "W_constraint": null, "input_dim": 10}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}