{"config": [{"config": {"border_mode": "valid", "bias": true, "activation": "linear", "input_dtype": "float32", "nb_row": 5, "subsample": [2, 2], "batch_input_shape": [null, 160, 320, 3], "nb_col": 5, "b_constraint": null, "W_regularizer": null, "name": "convolution2d_1", "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "nb_filter": 24, "activity_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "bias": true, "activation": "linear", "input_dtype": "float32", "nb_row": 5, "subsample": [2, 2], "batch_input_shape": [null, 160, 320, 3], "nb_col": 5, "b_constraint": null, "W_regularizer": null, "name": "convolution2d_2", "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "nb_filter": 36, "activity_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "bias": true, "activation": "linear", "input_dtype": "float32", "nb_row": 5, "subsample": [2, 2], "batch_input_shape": [null, 160, 320, 3], "nb_col": 5, "b_constraint": null, "W_regularizer": null, "name": "convolution2d_3", "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "nb_filter": 48, "activity_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "bias": true, "activation": "linear", "input_dtype": "float32", "nb_row": 3, "subsample": [1, 1], "batch_input_shape": [null, 160, 320, 3], "nb_col": 3, "b_constraint": null, "W_regularizer": null, "name": "convolution2d_4", "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "activity_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "bias": true, "activation": "linear", "input_dtype": "float32", "nb_row": 3, "subsample": [1, 1], "batch_input_shape": [null, 160, 320, 3], "nb_col": 3, "b_constraint": null, "W_regularizer": null, "name": "convolution2d_5", "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "activity_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias": true, "activation": "linear", "trainable": true, "b_constraint": null, "W_regularizer": null, "name": "dense_1", "activity_regularizer": null, "output_dim": 100, "b_regularizer": null, "input_dim": 27456, "init": "glorot_uniform", "W_constraint": null}, "class_name": "Dense"}, {"config": {"bias": true, "activation": "linear", "trainable": true, "b_constraint": null, "W_regularizer": null, "name": "dense_2", "activity_regularizer": null, "output_dim": 50, "b_regularizer": null, "input_dim": 100, "init": "glorot_uniform", "W_constraint": null}, "class_name": "Dense"}, {"config": {"bias": true, "activation": "linear", "trainable": true, "b_constraint": null, "W_regularizer": null, "name": "dense_3", "activity_regularizer": null, "output_dim": 10, "b_regularizer": null, "input_dim": 50, "init": "glorot_uniform", "W_constraint": null}, "class_name": "Dense"}, {"config": {"bias": true, "activation": "linear", "trainable": true, "b_constraint": null, "W_regularizer": null, "name": "dense_4", "activity_regularizer": null, "output_dim": 1, "b_regularizer": null, "input_dim": 10, "init": "glorot_uniform", "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}