{"config": [{"config": {"activity_regularizer": null, "batch_input_shape": [null, 40, 160, 1], "input_dtype": "float32", "nb_filter": 24, "bias": true, "activation": "linear", "dim_ordering": "tf", "W_regularizer": null, "nb_row": 2, "trainable": true, "W_constraint": null, "border_mode": "valid", "name": "convolution2d_1", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "nb_col": 2, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "nb_filter": 36, "bias": true, "activation": "linear", "dim_ordering": "tf", "W_regularizer": null, "nb_row": 2, "trainable": true, "W_constraint": null, "border_mode": "valid", "name": "convolution2d_2", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "nb_col": 2, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "nb_filter": 48, "bias": true, "activation": "linear", "dim_ordering": "tf", "W_regularizer": null, "nb_row": 2, "trainable": true, "W_constraint": null, "border_mode": "valid", "name": "convolution2d_3", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "nb_col": 2, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "nb_filter": 64, "bias": true, "activation": "linear", "dim_ordering": "tf", "W_regularizer": null, "nb_row": 2, "trainable": true, "W_constraint": null, "border_mode": "valid", "name": "convolution2d_4", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "nb_col": 2, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "nb_filter": 64, "bias": true, "activation": "linear", "dim_ordering": "tf", "W_regularizer": null, "nb_row": 2, "trainable": true, "W_constraint": null, "border_mode": "valid", "name": "convolution2d_5", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "nb_col": 2, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "bias": true, "activation": "linear", "W_regularizer": null, "input_dim": 3456, "trainable": true, "W_constraint": null, "output_dim": 100, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "bias": true, "activation": "linear", "W_regularizer": null, "input_dim": 100, "trainable": true, "W_constraint": null, "output_dim": 50, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "bias": true, "activation": "linear", "W_regularizer": null, "input_dim": 50, "trainable": true, "W_constraint": null, "output_dim": 10, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "bias": true, "activation": "linear", "W_regularizer": null, "input_dim": 10, "trainable": true, "W_constraint": null, "output_dim": 1, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "name": "dense_4"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}