{"config": [{"config": {"b_constraint": null, "init": "glorot_uniform", "input_dtype": "float32", "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "nb_filter": 24, "nb_row": 5, "bias": true, "name": "convolution2d_1", "activity_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "subsample": [2, 2], "nb_col": 5, "W_regularizer": null, "activation": "linear", "border_mode": "valid", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "input_dtype": "float32", "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "nb_filter": 36, "nb_row": 5, "bias": true, "name": "convolution2d_2", "activity_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "subsample": [2, 2], "nb_col": 5, "W_regularizer": null, "activation": "linear", "border_mode": "valid", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "input_dtype": "float32", "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "nb_filter": 48, "nb_row": 5, "bias": true, "name": "convolution2d_3", "activity_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "subsample": [2, 2], "nb_col": 5, "W_regularizer": null, "activation": "linear", "border_mode": "valid", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "input_dtype": "float32", "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "nb_row": 3, "bias": true, "name": "convolution2d_4", "activity_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "subsample": [1, 1], "nb_col": 3, "W_regularizer": null, "activation": "linear", "border_mode": "valid", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "input_dtype": "float32", "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "nb_row": 3, "bias": true, "name": "convolution2d_5", "activity_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "subsample": [1, 1], "nb_col": 3, "W_regularizer": null, "activation": "linear", "border_mode": "valid", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 27456, "bias": true, "W_regularizer": null, "output_dim": 100, "activity_regularizer": null, "trainable": true, "name": "dense_1", "activation": "linear", "W_constraint": null}, "class_name": "Dense"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 100, "bias": true, "W_regularizer": null, "output_dim": 50, "activity_regularizer": null, "trainable": true, "name": "dense_2", "activation": "linear", "W_constraint": null}, "class_name": "Dense"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 50, "bias": true, "W_regularizer": null, "output_dim": 10, "activity_regularizer": null, "trainable": true, "name": "dense_3", "activation": "linear", "W_constraint": null}, "class_name": "Dense"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 10, "bias": true, "W_regularizer": null, "output_dim": 1, "activity_regularizer": null, "trainable": true, "name": "dense_4", "activation": "linear", "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}