{"keras_version": "1.2.0", "config": [{"config": {"name": "cropping2d_1", "batch_input_shape": [null, 160, 320, 3], "trainable": true, "cropping": [[64, 30], [0, 0]], "input_dtype": "float32"}, "class_name": "Cropping2D"}, {"config": {"name": "lambda_1", "arguments": {}, "function_type": "lambda", "trainable": true, "output_shape": null, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0099\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}, "class_name": "Lambda"}, {"config": {"name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "nb_col": 5, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "nb_filter": 24, "bias": true, "W_constraint": null, "subsample": [2, 2], "nb_row": 5, "border_mode": "valid", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "nb_col": 5, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "nb_filter": 36, "bias": true, "W_constraint": null, "subsample": [2, 2], "nb_row": 5, "border_mode": "valid", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_2", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "nb_col": 5, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "nb_filter": 48, "bias": true, "W_constraint": null, "subsample": [2, 2], "nb_row": 5, "border_mode": "valid", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_3", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_4", "activity_regularizer": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "nb_col": 3, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "nb_filter": 64, "bias": true, "W_constraint": null, "subsample": [1, 1], "nb_row": 3, "border_mode": "valid", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_4", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_5", "activity_regularizer": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "nb_col": 3, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "nb_filter": 64, "bias": true, "W_constraint": null, "subsample": [1, 1], "nb_row": 3, "border_mode": "valid", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_5", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "activity_regularizer": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "bias": true, "W_constraint": null, "b_constraint": null, "output_dim": 100, "input_dim": 2112}, "class_name": "Dense"}, {"config": {"name": "dense_2", "activity_regularizer": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "bias": true, "W_constraint": null, "b_constraint": null, "output_dim": 50, "input_dim": 100}, "class_name": "Dense"}, {"config": {"name": "dense_3", "activity_regularizer": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "bias": true, "W_constraint": null, "b_constraint": null, "output_dim": 10, "input_dim": 50}, "class_name": "Dense"}, {"config": {"name": "dense_4", "activity_regularizer": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "bias": true, "W_constraint": null, "b_constraint": null, "output_dim": 1, "input_dim": 10}, "class_name": "Dense"}], "class_name": "Sequential"}