{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_row": 5, "name": "convolution2d_1", "batch_input_shape": [null, 160, 320, 1], "dim_ordering": "tf", "subsample": [2, 2], "nb_filter": 24, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "activation": "linear", "nb_col": 5, "input_dtype": "float32", "init": "glorot_uniform", "b_constraint": null, "bias": true, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "name": "convolution2d_2", "batch_input_shape": [null, 160, 320, 1], "dim_ordering": "tf", "subsample": [2, 2], "nb_filter": 36, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "activation": "linear", "nb_col": 5, "input_dtype": "float32", "init": "glorot_uniform", "b_constraint": null, "bias": true, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "name": "convolution2d_3", "batch_input_shape": [null, 160, 320, 1], "dim_ordering": "tf", "subsample": [2, 2], "nb_filter": 48, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "activation": "linear", "nb_col": 5, "input_dtype": "float32", "init": "glorot_uniform", "b_constraint": null, "bias": true, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "name": "convolution2d_4", "batch_input_shape": [null, 160, 320, 1], "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 64, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "activation": "linear", "nb_col": 3, "input_dtype": "float32", "init": "glorot_uniform", "b_constraint": null, "bias": true, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "name": "convolution2d_5", "batch_input_shape": [null, 160, 320, 1], "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 64, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "activation": "linear", "nb_col": 3, "input_dtype": "float32", "init": "glorot_uniform", "b_constraint": null, "bias": true, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_1", "W_regularizer": null, "output_dim": 100, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "input_dim": 27456, "activity_regularizer": null, "b_constraint": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_2", "W_regularizer": null, "output_dim": 50, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "input_dim": 100, "activity_regularizer": null, "b_constraint": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_3", "W_regularizer": null, "output_dim": 10, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "input_dim": 50, "activity_regularizer": null, "b_constraint": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_4", "W_regularizer": null, "output_dim": 1, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "input_dim": 10, "activity_regularizer": null, "b_constraint": null, "trainable": true}}]}